backend/controllers/NewsController.php

    public function actionStock($news_id)
{
    $active = News::find()->where(["id" => $news_id])->one();
        if($active->blog_status == 0)
        {
            $active->blog_status = 1;
            $active->save();
---
SELECT * FROM `tbl_news` WHERE `id`='1'
UPDATE `tbl_news` SET `blog_status`=1 WHERE `id`=1

     public function actionView()
    {
        $newslist = News::find()->where(['is_deleted' => 0])->all();
---
SELECT * FROM `tbl_news` WHERE `is_deleted`=0