backend/controllers/ProductController.php

    public function actionEdit()
    {

        $updateModel = new Products();

        $catList = Categories::find()->where(["is_deleted" => 0])->all();
---
SELECT * FROM `tbl_categories` WHERE `is_deleted`=0

                    }
                else
                   {
                         $updateModel->prod_display_image = Products::findone(Yii::$app->request->get('id'))->prod_display_image;
---
SELECT * FROM `tbl_products` WHERE `id`='39'

                   {
                    $time = time();

                    $deletefile1 = ProductsImages::find()->where(['prod_id' => Yii::$app->request->get('id')])->all();
---
SELECT * FROM `tbl_products_images` WHERE (`prod_id`='39') AND (`type`='Main')


                     foreach ($updateModel->main_image as $main_image)
                {
                    $main_image->saveAs('uploads/products/' . $main_image->baseName .'_'.$time.'.' . $main_image->extension);
---
UPDATE `tbl_products` SET `cat_id`=28, `updated_by`=1, `order_id`=NULL, `page_title`='Silver Plated SQ. Small Dish Open View', `meta_title`='Silver Plated SQ. Small Dish Open View', `meta_description`='Silver Plated SQ. Small Dish Open View', `url_name`='Silver-Plated-SQ-Small-Dish-Open-View' WHERE `id`=39