backend/controllers/SiteController.php

SELECT * FROM `tbl_users` WHERE `password_reset_token`='ad6c10726a590a68f4b4311260fb995d_1481189465'
---
     public function actionPassword_reset()
       {

            if(Yii::$app->request->get('token'))
            {
                $userModel = Users::find()->where(['password_reset_token' => Yii::$app->request->get('token')])->one();