backend/views/layouts/inner.php


<!-- toggle ative and inactive start -->

<?php $news_list = News::find()->where(['is_deleted' => '0'])->all();
---
SELECT * FROM `tbl_news` WHERE `is_deleted`='0'