backend/models/Users.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `tbl_users` WHERE `user_id`=1

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);
---
SELECT * FROM `tbl_users` WHERE `username`='admin@brasslinehirer.com'